<a href="https://colab.research.google.com/github/TKM-MCA-2020-DATA-SCIENCE-LAB/20MCA301-ABHILASH_JOHN/blob/master/Pandas_operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [ ]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].nunique

<bound method IndexOpsMixin.nunique of 0    444
1    555
2    666
3    444
Name: col2, dtype: int64>

no of occurence of a particular value inside a specified column

selecting data

In [ ]:
newdf = df[(df['col1']>2)&(df['col2']==666)]
newdf

   col1  col2 col3
2     3   666  ghi

In [ ]:
#applying funstions
def times2(x):
  return x*2

In [ ]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
#length
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
df['col2'].sum

<bound method Series.sum of 0    444
1    555
2    666
3    444
Name: col2, dtype: int64>

In [ ]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [ ]:
del df['col3']

In [ ]:
df

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
#sorting and ordering  a dataframe
df.sort_values(by='col2',inplace=True)

In [ ]:
df

   col1  col2
0     1   444
3     4   444
1     2   555
2     3   666

Data input and output